"Faces defining this Roof cannot be reacquired. Either delete the Roof or leave as it is.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRedoFaceRoof { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRedoFaceRoof As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRedoFaceRoof {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures WallFailures Class
  Autodesk.Revit.DB Namespace